<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5cf8e73b8f81fab44c243631d60d4e88d96e09b3917071e808ea4356a8a4c920","plan_job_ref":"Job Terraform Plan #531 at https://github.com/cal-itp/data-infra/actions/runs/17840344871","plan_out_hash":"03fea7e9837e2ad2d90b2352574c60ccdf63bc6998c205dfb2d5e3eca5e9fa4a","plan_hash":"d03a752a5025aa3cf3e5bdf6bfabe4aef8ed6dd8dad3affe57fa0e5342174c23","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/iam/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_member.tfer--projects-002F-cal-itp-data-infra-002F-roles-002F-AgencyPaymentsServiceReaderserviceAccount-003A-vctc-payments-user-0040-cal-itp-data-infra-002E-iam-002E-gserviceaccount-002E-com will be created
+   resource "google_project_iam_member" "tfer--projects-002F-cal-itp-data-infra-002F-roles-002F-AgencyPaymentsServiceReaderserviceAccount-003A-vctc-payments-user-0040-cal-itp-data-infra-002E-iam-002E-gserviceaccount-002E-com" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:vctc-payments-user@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = "projects/cal-itp-data-infra/roles/AgencyPaymentsServiceReader"
    }

  # google_service_account.vctc-payments-user will be created
+   resource "google_service_account" "vctc-payments-user" {
+       account_id = "******************"
+       disabled   = false
+       email      = "vctc-payments-user@cal-itp-data-infra.iam.gserviceaccount.com"
+       id         = (known after apply)
+       member     = "serviceAccount:vctc-payments-user@cal-itp-data-infra.iam.gserviceaccount.com"
+       name       = (known after apply)
+       project    = "cal-itp-data-infra"
+       unique_id  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #531](https://github.com/cal-itp/data-infra/actions/runs/17840344871)